In [ ]:
#SQLAlchemy way:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')
connection = engine.connect()
query = 'SELECT facility, SUM(total_cost) AS revenue FROM (SELECT firstname, surname, Facilities.name AS facility, CASE WHEN memid = 0 THEN "guest"ELSE "member" END AS person_type, CASE WHEN memid = 0 THEN guestcost*slots ELSE membercost*slots END AS total_cost FROM Bookings JOIN Members USING(memid) JOIN Facilities USING(facid)) AS total_cost_per_booking GROUP BY facility HAVING SUM(total_cost) < 1000 ORDER BY SUM(total_cost) DESC'
results = con.execute(query)
#check for table names
table_names = engine.table_names()
print(table_names)
df = pd.read_sql_query(query, connection)
df

In [ ]:
#see table names
cursor = connection.cursor()
cursor.execute(query)
cursor.fetchall()

In [ ]:
#or sqlite3.connect(countryclub_db)?

In [22]:
# Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members!


# ANSWER 10:

import pandas as pd
import sqlite3 as sql
countryclub_db = 'sqlite_db_pythonsqlite.db'
connection = sql.connect(countryclub_db)
query = 'SELECT facility, SUM(total_cost) AS revenue FROM (SELECT firstname, surname, Facilities.name AS facility, CASE WHEN memid = 0 THEN "guest"ELSE "member" END AS person_type, CASE WHEN memid = 0 THEN guestcost*slots ELSE membercost*slots END AS total_cost FROM Bookings JOIN Members USING(memid) JOIN Facilities USING(facid)) AS total_cost_per_booking GROUP BY facility HAVING SUM(total_cost) < 1000 ORDER BY SUM(total_cost) DESC'
df = pd.read_sql_query(query, connection)
df

#query:
# SELECT facility, SUM(total_cost) AS revenue
# FROM
# (SELECT firstname, surname, Facilities.name AS facility, CASE WHEN memid = 0 THEN "guest"
# ELSE "member" END AS person_type,
# CASE WHEN memid = 0 THEN guestcost*slots
# ELSE membercost*slots END AS total_cost
# FROM Bookings
# JOIN Members USING(memid)
# JOIN Facilities USING(facid)) AS total_cost_per_booking
# GROUP BY facility HAVING SUM(total_cost) < 1000 ORDER BY SUM(total_cost) DESC

        facility  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

In [27]:
# Q11: Produce a report of members and who recommended them in alphabetic surname, firstname order */


# ANSWER 11:
query = 'SELECT m1.firstname, m1.surname, m2.firstname AS recommendedby_firstname, m2.surname AS recommendedby_surname FROM Members AS m1 JOIN Members AS m2 ON m1.recommendedby = m2.memid WHERE m1.recommendedby !="" ORDER BY m1.surname, m1.firstname;'
df = pd.read_sql_query(query, connection)
df

#query:
# SELECT m1.firstname, m1.surname, m2.firstname AS recommendedby_firstname, m2.surname
# AS recommendedby_surname
# FROM Members AS m1
# JOIN Members AS m2
# ON m1.recommendedby = m2.memid
# WHERE m1.recommendedby !=''
# ORDER BY surname, firstname;

    firstname            surname recommendedby_firstname recommendedby_surname
0    Florence              Bader                  Ponder              Stibbons
1        Anne              Baker                  Ponder              Stibbons
2     Timothy              Baker                  Jemima               Farrell
3         Tim             Boothe                     Tim                Rownam
4      Gerald            Butters                  Darren                 Smith
5        Joan             Coplin                 Timothy                 Baker
6       Erica            Crumpet                   Tracy                 Smith
7       Nancy               Dare                  Janice              Joplette
8     Matthew            Genting                  Gerald               Butters
9        John               Hunt               Millicent               Purview
10      David              Jones                  Janice              Joplette
11    Douglas              Jones                   David                 Jones
12     Janice           Joplette                  Darren                 Smith
13       Anna          Mackenzie                  Darren                 Smith
14    Charles               Owen                  Darren                 Smith
15      David             Pinker                  Jemima               Farrell
16  Millicent            Purview                   Tracy                 Smith
17  Henrietta             Rumney                 Matthew               Genting
18  Ramnaresh             Sarwin                Florence                 Bader
19       Jack              Smith                  Darren                 Smith
20     Ponder           Stibbons                  Burton                 Tracy
21      Henry  Worthington-Smyth                   Tracy                 Smith

In [28]:
# Q12: Find the facilities with their usage by members, but not guests */


# ANSWER 12:
query = 'SELECT name AS facility, SUM(slots) AS member_bookings FROM Bookings JOIN Facilities USING(facid) WHERE memid !=0 GROUP BY facility ORDER BY SUM(slots) DESC;'

df = pd.read_sql_query(query, connection)
df

#query:
# SELECT name AS facility, SUM(slots) AS member_bookings
# FROM Bookings
# JOIN Facilities
# USING(facid)
# WHERE memid !=0
# GROUP BY facility
# ORDER BY SUM(slots) DESC;

          facility  member_bookings
0  Badminton Court             1086
1   Tennis Court 1              957
2   Massage Room 1              884
3   Tennis Court 2              882
4    Snooker Table              860
5       Pool Table              856
6     Table Tennis              794
7     Squash Court              418
8   Massage Room 2               54

In [33]:
# Q13: Find the facilities usage by month, by members only, not guests */


# ANSWER 13:
query = 'SELECT name AS facility, strftime("%m", starttime) AS month, SUM(slots) AS guest_bookings FROM Bookings JOIN Facilities USING(facid) WHERE memid = 0 GROUP BY facility, month ORDER BY month, SUM(slots) DESC;'

df = pd.read_sql_query(query, connection)
df

# query:
# SELECT name AS facility, EXTRACT(MONTH FROM starttime) AS month, SUM(slots) AS guest_bookings
# /* NOTE - in python/jupyter we can't use EXTRACT for some reason, at least not in this way,
# so have to use something like "strftime("%m", starttime)" instead, used above 
# FROM Bookings
# JOIN Facilities
# USING(facid)
# WHERE memid = 0
# GROUP BY facility, month
# ORDER BY month, SUM(slots) DESC;

           facility month  guest_bookings
0      Squash Court    07             114
1    Massage Room 1    07              98
2    Tennis Court 2    07              84
3    Tennis Court 1    07              69
4    Massage Room 2    07              16
5     Snooker Table    07              16
6   Badminton Court    07              15
7        Pool Table    07               7
8      Table Tennis    07               6
9      Squash Court    08             216
10   Massage Room 1    08             176
11   Tennis Court 2    08             138
12   Tennis Court 1    08             120
13   Massage Room 2    08              64
14  Badminton Court    08              45
15       Pool Table    08              19
16    Snooker Table    08              10
17     Table Tennis    08               8
18     Squash Court    09             356
19   Massage Room 1    09             246
20   Tennis Court 1    09             174
21   Tennis Court 2    09             174
22   Massage Room 2    09              94
23  Badminton Court    09              63
24       Pool Table    09              28
25    Snooker Table    09              22
26     Table Tennis    09              22